jmeter.log
2025-02-27 15:44:40,966 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-02-27 15:44:41,000 INFO o.a.j.JMeter: Loading user properties from: user.properties
2025-02-27 15:44:41,001 INFO o.a.j.JMeter: Loading system properties from: system.properties
2025-02-27 15:44:41,011 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-02-27 15:44:41,011 INFO o.a.j.JMeter: Version 5.6.3
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: java.version=21.0.2
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: os.name=Windows 10
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: os.arch=amd64
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: os.version=10.0
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: java.awt.headless=true
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: Max memory     =1073741824
2025-02-27 15:44:41,012 INFO o.a.j.JMeter: Available Processors =16
2025-02-27 15:44:41,029 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-02-27 15:44:41,030 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-02-27 15:44:41,030 INFO o.a.j.JMeter: JMeterHome=C:\Users\Student\Downloads\apache-jmeter-5.6.3
2025-02-27 15:44:41,030 INFO o.a.j.JMeter: user.dir  =C:\Users\Student\Downloads\apache-jmeter-5.6.3\bin
2025-02-27 15:44:41,031 INFO o.a.j.JMeter: PWD       =C:\Users\Student\Downloads\apache-jmeter-5.6.3\bin
2025-02-27 15:44:45,578 INFO o.a.j.JMeter: IP: 172.27.144.1 Name: EJOI-2 FullName: EJOI-2
2025-02-27 15:44:45,600 INFO o.a.j.s.FileServer: Default base='C:\Users\Student\Downloads\apache-jmeter-5.6.3\bin'
2025-02-27 15:44:45,600 INFO o.a.j.s.FileServer: Set new base='C:\Users\Student\Downloads\apache-jmeter-5.6.3\bin'
2025-02-27 15:44:45,957 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-02-27 15:44:46,020 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-02-27 15:44:46,026 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-02-27 15:44:46,032 INFO o.a.j.s.SaveService: Loading file: HW3.jmx
2025-02-27 15:44:46,189 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-27 15:44:46,190 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-27 15:44:46,190 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-27 15:44:46,190 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-02-27 15:44:46,190 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-02-27 15:44:46,190 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-02-27 15:44:46,330 INFO o.a.j.JMeter: Creating summariser <summary>
2025-02-27 15:44:46,354 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-02-27 15:44:46,356 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-02-27 15:44:46,356 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-02-27 15:44:46,364 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-02-27 15:44:46,365 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-02-27 15:44:46,432 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Student\Downloads\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-json-2.7.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-02-27 15:44:46,446 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Student\Downloads\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-casutg-3.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-02-27 15:44:46,467 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Student\Downloads\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-02-27 15:44:47,099 INFO o.a.j.JMeter: Running test (1740656687099)
2025-02-27 15:44:47,136 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-02-27 15:44:47,136 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2025-02-27 15:44:47,136 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-02-27 15:44:47,137 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2025-02-27 15:44:47,150 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-02-27 15:44:47,150 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-02-27 15:44:47,155 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-02-27 15:44:47,156 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-02-27 15:44:47,156 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-02-27 15:44:47,156 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-02-27 15:44:47,158 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-02-27 15:44:49,007 WARN o.a.j.f.Groovy: Error running groovy script
javax.script.ScriptException: javax.script.ScriptException: java.lang.NumberFormatException: Cannot parse null string
	at org.codehaus.groovy.jsr223.GroovyScriptEngineImpl.eval(GroovyScriptEngineImpl.java:158) ~[groovy-jsr223-3.0.20.jar:3.0.20]
	at java.scripting/javax.script.AbstractScriptEngine.eval(AbstractScriptEngine.java:231) ~[java.scripting:?]
	at org.apache.jmeter.functions.Groovy.execute(Groovy.java:123) ~[ApacheJMeter_functions.jar:5.6.3]
	at org.apache.jmeter.engine.util.CompoundVariable.execute(CompoundVariable.java:139) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.engine.util.CompoundVariable.execute(CompoundVariable.java:114) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.testelement.property.FunctionProperty.getStringValue(FunctionProperty.java:104) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.testelement.AbstractTestElement.getPropertyAsString(AbstractTestElement.java:409) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.control.SwitchController.getSelection(SwitchController.java:132) ~[ApacheJMeter_components.jar:5.6.3]
	at org.apache.jmeter.control.SwitchController.getSelectionAsInt(SwitchController.java:90) ~[ApacheJMeter_components.jar:5.6.3]
	at org.apache.jmeter.control.SwitchController.next(SwitchController.java:62) ~[ApacheJMeter_components.jar:5.6.3]
	at org.apache.jmeter.control.GenericController.nextIsAController(GenericController.java:232) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.control.GenericController.next(GenericController.java:185) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.control.LoopController.next(LoopController.java:119) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.control.GenericController.nextIsAController(GenericController.java:232) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.control.GenericController.next(GenericController.java:185) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.control.LoopController.next(LoopController.java:119) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.threads.AbstractThreadGroup.next(AbstractThreadGroup.java:109) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.threads.JMeterThread.run(JMeterThread.java:303) ~[ApacheJMeter_core.jar:5.6.3]
	at java.base/java.lang.Thread.run(Thread.java:1583) [?:?]
Caused by: javax.script.ScriptException: java.lang.NumberFormatException: Cannot parse null string
	at org.codehaus.groovy.jsr223.GroovyScriptEngineImpl.eval(GroovyScriptEngineImpl.java:320) ~[groovy-jsr223-3.0.20.jar:3.0.20]
	at org.codehaus.groovy.jsr223.GroovyScriptEngineImpl.eval(GroovyScriptEngineImpl.java:155) ~[groovy-jsr223-3.0.20.jar:3.0.20]
	... 18 more
Caused by: java.lang.NumberFormatException: Cannot parse null string
	at java.base/java.lang.Integer.parseInt(Integer.java:624) ~[?:?]
	at java.base/java.lang.Integer.parseInt(Integer.java:778) ~[?:?]
	at java_lang_Integer$parseInt.call(Unknown Source) ~[?:?]
	at org.codehaus.groovy.runtime.callsite.CallSiteArray.defaultCall(CallSiteArray.java:47) ~[groovy-3.0.20.jar:3.0.20]
	at org.codehaus.groovy.runtime.callsite.AbstractCallSite.call(AbstractCallSite.java:125) ~[groovy-3.0.20.jar:3.0.20]
	at org.codehaus.groovy.runtime.callsite.AbstractCallSite.call(AbstractCallSite.java:139) ~[groovy-3.0.20.jar:3.0.20]
	at Script1.run(Script1.groovy:1) ~[?:?]
	at org.codehaus.groovy.jsr223.GroovyScriptEngineImpl.eval(GroovyScriptEngineImpl.java:317) ~[groovy-jsr223-3.0.20.jar:3.0.20]
	at org.codehaus.groovy.jsr223.GroovyScriptEngineImpl.eval(GroovyScriptEngineImpl.java:155) ~[groovy-jsr223-3.0.20.jar:3.0.20]
	... 18 more
2025-02-27 15:44:49,292 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = EJOI-2
2025-02-27 15:44:49,292 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-02-27 15:44:49,523 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2025-02-27 15:44:49,539 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2025-02-27 15:44:49,539 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2025-02-27 15:44:49,570 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2025-02-27 15:44:49,586 INFO o.a.j.u.SSLManager: KeyStore created OK
2025-02-27 15:44:49,586 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2025-02-27 15:44:49,909 INFO o.a.j.u.BeanShellTestElement: Row Index: 1
2025-02-27 15:44:49,909 INFO o.a.j.u.BeanShellTestElement: SQL Email: roncheg@example.com
2025-02-27 15:44:49,909 INFO o.a.j.u.BeanShellTestElement: Extracted Email: george.bluth@reqres.in
2025-02-27 15:44:49,909 INFO o.a.j.u.BeanShellTestElement: First Name: Roncheg
2025-02-27 15:44:50,157 WARN o.a.j.p.j.s.J.JSR223 Sampler: Emails do not match for user ID: null. SQL email: roncheg@example.com, Extracted email: george.bluth@reqres.in
2025-02-27 15:44:50,442 INFO o.a.j.u.BeanShellTestElement: Row Index: 3
2025-02-27 15:44:50,442 INFO o.a.j.u.BeanShellTestElement: SQL Email: gverberg@example.com
2025-02-27 15:44:50,442 INFO o.a.j.u.BeanShellTestElement: Extracted Email: emma.wong@reqres.in
2025-02-27 15:44:50,442 INFO o.a.j.u.BeanShellTestElement: First Name: Gverberg
2025-02-27 15:44:50,457 WARN o.a.j.p.j.s.J.JSR223 Sampler: Emails do not match for user ID: null. SQL email: gverberg@example.com, Extracted email: emma.wong@reqres.in
2025-02-27 15:44:50,457 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-02-27 15:44:50,457 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-02-27 15:44:50,457 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-02-27 15:44:50,478 INFO o.a.j.r.Summariser: summary =      3 in 00:00:03 =    0.9/s Avg:   349 Min:     5 Max:   824 Err:     0 (0.00%)